
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第11章-后端编译与优化 · 深入理解Java虚拟机</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-solarizedlight.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="第10章-前端编译与优化.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="第1章-走进Java.html">
            
                <a href="第1章-走进Java.html">
            
                    
                    第1章-走进Java
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="第2章-Java内存区域与内存溢出异常.html">
            
                <a href="第2章-Java内存区域与内存溢出异常.html">
            
                    
                    第2章-Java内存区域与内存溢出异常
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="第3章-垃圾收集器与内存分配策略.html">
            
                <a href="第3章-垃圾收集器与内存分配策略.html">
            
                    
                    第3章-垃圾收集器与内存分配策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="第4章-虚拟机性能监控、故障处理工具.html">
            
                <a href="第4章-虚拟机性能监控、故障处理工具.html">
            
                    
                    第4章-虚拟机性能监控、故障处理工具
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="第5章-调优案例分析与实战.html">
            
                <a href="第5章-调优案例分析与实战.html">
            
                    
                    第5章-调优案例分析与实战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="第6章-类文件结构.html">
            
                <a href="第6章-类文件结构.html">
            
                    
                    第6章-类文件结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="第7章-虚拟机类加载机制.html">
            
                <a href="第7章-虚拟机类加载机制.html">
            
                    
                    第7章-虚拟机类加载机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="第8章-虚拟机字节码执行引擎.html">
            
                <a href="第8章-虚拟机字节码执行引擎.html">
            
                    
                    第8章-虚拟机字节码执行引擎
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="第9章-类加载及执行子系统的案例与实战.html">
            
                <a href="第9章-类加载及执行子系统的案例与实战.html">
            
                    
                    第9章-类加载及执行子系统的案例与实战
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="第10章-前端编译与优化.html">
            
                <a href="第10章-前端编译与优化.html">
            
                    
                    第10章-前端编译与优化
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="第11章-后端编译与优化.html">
            
                <a href="第11章-后端编译与优化.html">
            
                    
                    第11章-后端编译与优化
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第11章-后端编译与优化</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#&#x6982;&#x8FF0;"><b>1. </b>&#x6982;&#x8FF0;</a></li><li><span class="title-icon "></span><a href="#&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;"><b>2. </b>&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;</a></li><ul><li><span class="title-icon "></span><a href="#&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;"><b>2.1. </b>&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;</a></li><li><span class="title-icon "></span><a href="#&#x7F16;&#x8BD1;&#x5BF9;&#x8C61;&#x4E0E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;"><b>2.2. </b>&#x7F16;&#x8BD1;&#x5BF9;&#x8C61;&#x4E0E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;</a></li></ul></ul></div><a href="#&#x6982;&#x8FF0;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="&#x6982;&#x8FF0;"><a name="&#x6982;&#x8FF0;" class="anchor-navigation-ex-anchor" href="#&#x6982;&#x8FF0;"><i class="fa fa-link" aria-hidden="true"></i></a>1. &#x6982;&#x8FF0;</h1>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x5B57;&#x8282;&#x7801;&#x770B;&#x4F5C;&#x662F;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x79CD;&#x4E2D;&#x95F4;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF08;Intermediate Representation&#xFF0C;IR&#xFF09;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x7F16;&#x8BD1;&#x5668;&#x65E0;&#x8BBA;&#x5728;&#x4F55;&#x65F6;&#x3001;&#x5728;&#x4F55;&#x79CD;&#x72B6;&#x6001;&#x4E0B;&#x628A;Class&#x6587;&#x4EF6;&#x8F6C;&#x6362;&#x6210;&#x4E0E;&#x672C;&#x5730;&#x76F8;&#x5173;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x5B83;&#x90FD;&#x53EF;&#x4EE5;&#x89C6;&#x4E3A;&#x6574;&#x4E2A;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x7684;&#x540E;&#x7AEF;&#x3002;</p>
<h1 id="&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;"><a name="&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;" class="anchor-navigation-ex-anchor" href="#&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;"><i class="fa fa-link" aria-hidden="true"></i></a>2. &#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;</h1>
<p>&#x865A;&#x62DF;&#x673A;&#x53D1;&#x73B0;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x6216;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x8FD0;&#x884C;&#x7279;&#x522B;&#x9891;&#x7E41;&#xFF0C;&#x5C31;&#x4F1A;&#x628A;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x8BA4;&#x5B9A;&#x4E3A;&#x201C;&#x70ED;&#x70B9;&#x4EE3;&#x7801;&#x201D;&#xFF08;Hot Spot Code&#xFF09;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x70ED;&#x70B9;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x5C06;&#x4F1A;&#x628A;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#x6210;&#x672C;&#x5730;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x5E76;&#x4EE5;&#x5404;&#x79CD;&#x624B;&#x6BB5;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x4F18;&#x5316;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x540E;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x88AB;&#x79F0;&#x4E3A;<strong><u>&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;</u></strong>&#x3002;</p>
<h2 id="&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;"><a name="&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;" class="anchor-navigation-ex-anchor" href="#&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;"><i class="fa fa-link" aria-hidden="true"></i></a>2.1. &#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;</h2>
<ul>
<li><p>&#x76EE;&#x524D;&#x4E3B;&#x6D41;&#x7684;&#x5546;&#x7528;Java&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x8B6C;&#x5982;HotSpot&#x3001;OpenJ9&#x7B49;&#xFF0C;&#x5185;&#x90E8;&#x90FD;&#x540C;&#x65F6;&#x5305;&#x542B;&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;&#xFF1A;</p>
<ul>
<li><p>&#x5F53;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x8FC5;&#x901F;&#x542F;&#x52A8;&#x548C;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x89E3;&#x91CA;&#x5668;&#x53EF;&#x4EE5;&#x9996;&#x5148;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x7701;&#x53BB;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7ACB;&#x5373;&#x8FD0;&#x884C;&#x3002;</p>
</li>
<li><p>&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x9010;&#x6E10;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x628A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#x6210;&#x672C;&#x5730;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x4E2D;&#x95F4;&#x635F;&#x8017;&#xFF0C;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x3002;</p>
</li>
<li><p>&#x5F53;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#x5185;&#x5B58;&#x8D44;&#x6E90;&#x9650;&#x5236;&#x8F83;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x8282;&#x7EA6;&#x5185;&#x5B58;&#x3002;</p>
</li>
<li><p>&#x89E3;&#x91CA;&#x5668;&#x8FD8;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x6FC0;&#x8FDB;&#x4F18;&#x5316;&#x65F6;&#x540E;&#x5907;&#x7684;&#x201C;&#x9003;&#x751F;&#x95E8;&#x201D;&#x3002;</p>
</li>
<li><blockquote>
<p>&#x7F16;&#x8BD1;&#x5668;&#x6839;&#x636E;&#x6982;&#x7387;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x90FD;&#x6B63;&#x786E;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x90FD;&#x80FD;&#x63D0;&#x5347;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x7684;&#x4F18;&#x5316;&#x624B;&#x6BB5;&#xFF0C;&#x5F53;&#x6FC0;&#x8FDB;&#x4F18;&#x5316;&#x7684;&#x5047;&#x8BBE;&#x4E0D;&#x6210;&#x7ACB;&#xFF0C;&#x5982;&#x52A0;&#x8F7D;&#x4E86;&#x65B0;&#x7C7B;&#x4EE5;&#x540E;&#xFF0C;&#x7C7B;&#x578B;&#x7EE7;&#x627F;&#x7ED3;&#x6784;&#x51FA;&#x73B0;&#x53D8;&#x5316;&#x3001;&#x51FA;&#x73B0; <u>&#x201C;&#x7F55;&#x89C1;&#x9677;&#x9631;&#x201D;</u> &#x65F6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <u>&#x9006;&#x4F18;&#x5316;</u> &#x9000;&#x56DE;&#x5230;&#x89E3;&#x91CA;&#x72B6;&#x6001;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</p>
</blockquote>
</li>
</ul>
</li>
<li><p>&#x603B;&#x4E4B;&#xFF0C;&#x6574;&#x4E2A;Java&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x67B6;&#x6784;&#x91CC;&#xFF0C;&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;&#x7ECF;&#x5E38;&#x662F;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x5730;&#x914D;&#x5408;&#x5DE5;&#x4F5C;&#x3002;</p>
</li>
</ul>
<p><img src="images/image-20231011193642232.png" alt="image-20231011193642232" style="zoom: 50%;"></p>
<ul>
<li><p>HotSpot&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x5185;&#x7F6E;&#x4E86;&#x4E24;/&#x4E09;&#x4E2A;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#xFF1A;</p>
<ol>
<li><strong>&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;</strong>&#xFF1A;&#x53C8;&#x79F0;C1&#x7F16;&#x8BD1;&#x5668;</li>
<li><strong>&#x670D;&#x52A1;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;</strong>&#xFF1A;&#x53C8;&#x79F0;C2&#x7F16;&#x8BD1;&#x5668;</li>
<li><strong>Graal&#x7F16;&#x8BD1;&#x5668;</strong>&#xFF1A;&#x5728;JDK10&#x4E2D;&#x51FA;&#x73B0;&#xFF0C;&#x957F;&#x671F;&#x76EE;&#x6807;&#x662F;&#x4EE3;&#x66FF;C2&#x7684;Graal&#x7F16;&#x8BD1;&#x5668;&#x3002;&#x4F46;Graal&#x7F16;&#x8BD1;&#x5668;&#x76EE;&#x524D;&#x8FD8;&#x5904;&#x4E8E;&#x5B9E;&#x9A8C;&#x72B6;&#x6001;&#x3002;</li>
</ol>
</li>
<li><p>&#x5728;<u>&#x5206;&#x5C42;&#x7F16;&#x8BD1;</u>&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#x51FA;&#x73B0;&#x4EE5;&#x524D;&#xFF0C;HotSpot&#x865A;&#x62DF;&#x673A;&#x901A;&#x5E38;&#x662F;&#x91C7;&#x7528;&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x76F4;&#x63A5;&#x642D;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#xFF0C;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x53EA;&#x53D6;&#x51B3;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;HotSpot&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x7248;&#x672C;&#x4E0E;&#x5BBF;&#x4E3B;&#x673A;&#x5668;&#x7684;&#x786C;&#x4EF6;&#x6027;&#x80FD;&#x81EA;&#x52A8;&#x9009;&#x62E9;&#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#xFF0C;&#x7528;&#x6237;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201C;-client&#x201D;&#x6216;&#x201C;-server&#x201D;&#x53C2;&#x6570;&#x53BB;&#x5F3A;&#x5236;&#x6307;&#x5B9A;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x6A21;&#x5F0F;&#x8FD8;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x6A21;&#x5F0F;&#x3002;</p>
</li>
<li>&#x65E0;&#x8BBA;&#x91C7;&#x7528;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x8FD8;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;&#x642D;&#x914D;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x88AB;&#x79F0;&#x4E3A; <strong><u>&#x201C;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#x201D;</u></strong> &#x3002;</li>
<li>&#x7528;&#x6237;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x201C;-Xint&#x201D;&#x5F3A;&#x5236;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x4E8E; <strong><u>&#x201C;&#x89E3;&#x91CA;&#x6A21;&#x5F0F;&#x201D;</u></strong> &#xFF1A;&#x8FD9;&#x65F6;&#x5019;&#x7F16;&#x8BD1;&#x5668;&#x5B8C;&#x5168;&#x4E0D;&#x4ECB;&#x5165;&#x5DE5;&#x4F5C;&#xFF0C;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#x90FD;&#x4F7F;&#x7528;&#x89E3;&#x91CA;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x3002;</li>
<li>&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x201C;-Xcomp&#x201D;&#x5F3A;&#x5236;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x4E8E; <strong><u>&#x201C;&#x7F16;&#x8BD1;&#x6A21;&#x5F0F;&#x201D;</u></strong> &#xFF1A;&#x8FD9;&#x65F6;&#x5019;&#x5C06;&#x4F18;&#x5148;&#x91C7;&#x7528;&#x7F16;&#x8BD1;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x89E3;&#x91CA;&#x5668;&#x4ECD;&#x7136;&#x8981;&#x5728;&#x7F16;&#x8BD1;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4ECB;&#x5165;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x3002;</li>
</ul>
<hr>
<blockquote>
<p>&#x7531;&#x4E8E;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x5360;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x901A;&#x5E38;&#x8981;&#x7F16;&#x8BD1;&#x51FA;&#x4F18;&#x5316;&#x7A0B;&#x5EA6;&#x8D8A;&#x9AD8;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x4FBF;&#x4F1A;&#x8D8A;&#x957F;&#xFF1B;&#x800C;&#x4E14;&#x60F3;&#x8981;&#x7F16;&#x8BD1;&#x51FA;&#x4F18;&#x5316;&#x7A0B;&#x5EA6;&#x66F4;&#x9AD8;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x89E3;&#x91CA;&#x5668;&#x53EF;&#x80FD;&#x8FD8;&#x8981;&#x66FF;&#x7F16;&#x8BD1;&#x5668;&#x6536;&#x96C6;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x5BF9;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x9636;&#x6BB5;&#x7684;&#x901F;&#x5EA6;&#x4E5F;&#x6709;&#x6240;&#x5F71;&#x54CD;&#x3002;</p>
</blockquote>
<p>&#x4E3A;&#x4E86;&#x5728;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#x4E0E;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x4E4B;&#x95F4;&#x8FBE;&#x5230;&#x6700;&#x4F73;&#x5E73;&#x8861;&#xFF0C;HotSpot&#x865A;&#x62DF;&#x673A;&#x5728;&#x7F16;&#x8BD1;&#x5B50;&#x7CFB;&#x7EDF;&#x4E2D;&#x52A0;&#x5165;&#x4E86; <strong><u>&#x5206;&#x5C42;&#x7F16;&#x8BD1;</u></strong> &#x7684;&#x529F;&#x80FD;&#xFF1A;</p>
<ul>
<li><strong>&#x7B2C;0&#x5C42;</strong>&#xFF1A;&#x7A0B;&#x5E8F;&#x7EAF;&#x89E3;&#x91CA;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x89E3;&#x91CA;&#x5668;&#x4E0D;&#x5F00;&#x542F;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x529F;&#x80FD;&#x3002;</li>
<li><strong>&#x7B2C;1&#x5C42;</strong>&#xFF1A;&#x4F7F;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x5C06;&#x5B57;&#x8282;&#x7801;&#x7F16;&#x8BD1;&#x4E3A;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x6765;&#x8FD0;&#x884C;&#xFF0C;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x53EF;&#x9760;&#x7684;&#x7A33;&#x5B9A;&#x4F18;&#x5316;&#xFF0C;&#x4E0D;&#x5F00;&#x542F;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x529F;&#x80FD;&#x3002;</li>
<li><strong>&#x7B2C;2&#x5C42;</strong>&#xFF1A;&#x4ECD;&#x7136;&#x4F7F;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x6267;&#x884C;&#xFF0C;&#x4EC5;&#x5F00;&#x542F;&#x65B9;&#x6CD5;&#x53CA;&#x56DE;&#x8FB9;&#x6B21;&#x6570;&#x7EDF;&#x8BA1;&#x7B49;&#x6709;&#x9650;&#x7684;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x529F;&#x80FD;&#x3002;</li>
<li><strong>&#x7B2C;3&#x5C42;</strong>&#xFF1A;&#x4ECD;&#x7136;&#x4F7F;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x6267;&#x884C;&#xFF0C;&#x5F00;&#x542F;&#x5168;&#x90E8;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#xFF0C;&#x9664;&#x4E86;&#x7B2C;2&#x5C42;&#x7684;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x5916;&#xFF0C;&#x8FD8;&#x4F1A;&#x6536;&#x96C6;&#x5982;&#x5206;&#x652F;&#x8DF3;&#x8F6C;&#x3001;&#x865A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7248;&#x672C;&#x7B49;&#x5168;&#x90E8;&#x7684;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x3002;</li>
<li><strong>&#x7B2C;4&#x5C42;</strong>&#xFF1A;&#x4F7F;&#x7528;&#x670D;&#x52A1;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x5C06;&#x5B57;&#x8282;&#x7801;&#x7F16;&#x8BD1;&#x4E3A;&#x672C;&#x5730;&#x4EE3;&#x7801;&#xFF0C;&#x76F8;&#x6BD4;&#x8D77;&#x5BA2;&#x6237;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x542F;&#x7528;&#x66F4;&#x591A;&#x7F16;&#x8BD1;&#x8017;&#x65F6;&#x66F4;&#x957F;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x8FD8;&#x4F1A;&#x6839;&#x636E;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x6FC0;&#x8FDB;&#x4F18;&#x5316;&#x3002;</li>
</ul>
<p><img src="images/image-20231011195613013.png" alt="image-20231011195613013" style="zoom:60%;"></p>
<h2 id="&#x7F16;&#x8BD1;&#x5BF9;&#x8C61;&#x4E0E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;"><a name="&#x7F16;&#x8BD1;&#x5BF9;&#x8C61;&#x4E0E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;" class="anchor-navigation-ex-anchor" href="#&#x7F16;&#x8BD1;&#x5BF9;&#x8C61;&#x4E0E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;"><i class="fa fa-link" aria-hidden="true"></i></a>2.2. &#x7F16;&#x8BD1;&#x5BF9;&#x8C61;&#x4E0E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;</h2>
<blockquote>
<p>&#x70ED;&#x70B9;&#x4EE3;&#x7801;&#x4E3B;&#x8981;&#x6709;&#x5982;&#x4E0B;&#x4E24;&#x7C7B;&#xFF1A;</p>
<ul>
<li>&#x88AB;&#x591A;&#x6B21;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x88AB;&#x591A;&#x6B21;&#x8C03;&#x7528;&#x7684;&#x5FAA;&#x73AF;&#x4F53;&#x3002;</li>
</ul>
</blockquote>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> By <a href="https://github.com/poker-svg" target="_blank">YangXin Xu</a> </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <i>updated</i> 2023-10-11 19:58:59 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第10章-前端编译与优化.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第10章-前端编译与优化">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第11章-后端编译与优化","level":"1.12","depth":1,"previous":{"title":"第10章-前端编译与优化","level":"1.11","depth":1,"path":"第10章-前端编译与优化.md","ref":"第10章-前端编译与优化.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters","copy-code-button","page-footer-ex","anchor-navigation-ex","expandable-chapters-small","prism","-highlight","-lunr","-search","search-pro","-sharing","splitter","hide-element","insert-logo","code","livereload"],"ignores":["_book","node_modules"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-solarizedlight.css"],"lang":{"flow":"typescript"}},"livereload":{},"page-footer-ex":{"copyright":"By [YangXin Xu](https://github.com/poker-svg)","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<i>updated</i>"},"splitter":{},"search-pro":{},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":true},"expandable-chapters-small":{},"copy-code-button":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 120px; min-height: 120px","url":"./images/icon.png"},"expandable-chapters":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"深入理解Java虚拟机","gitbook":"*"},"file":{"path":"第11章-后端编译与优化.md","mtime":"2023-10-11T11:58:59.045Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-10-11T12:00:22.731Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

